from Getgoods import getgoods
class inCode(object):
    def __init__(self,allgoods):
        # print("""
        # 根据需要选择操作符：
        # 1、输入商品信息或者商品号查看是是否有该商品和该商品信息
        # 2、
        # 3、拍卖该商品
        # 4、返回上级
        # """)
        self.allgoods = allgoods
        pass

    def trytest(self):
        print('测试')

    def seachgoods(self):
        goodinfo = set()
        while True:
            print("""
                请输入你想查询的商品或者usedNo：
                1、输入差所有店铺
                2、输入只差京东备件库
                3、退出
                 """)
            inUsedNo = input()
            goodsinfo = self.allgoods.getUsedNo(inUsedNo,1)
            if goodsinfo != None:
                for value in goodsinfo:
                    print(value)
            else:
                print("没有相关商品")
            # if inUsedNo == str(""):
            #     goodsinfo = self.allgoods.getUsedNo(inUsedNo)
            #     if goodsinfo != None:
            #         for value in goodsinfo:
            #             print(value)
            # elif inUsedNo == str(""):
            #     pass
            # else:
            #     pass

# ('19143330701', '7成新', '0', '罗技（Logitech）K380多设备蓝牙键盘 IPAD键盘 手机键盘 红色'), ('1000033031280901', '9成新', '0', '罗技(Logitech)K380多设备蓝牙键盘 芍药白'), ('1000022437810901', '9成新', '0', '罗技(Logitech)K380多设备蓝牙键盘 茱萸粉'), ('1000022437810901', '9成新', '0', '罗技(Logitech)K380多设备蓝牙键盘 茱萸粉'), ('1000033031280901', '9成新', '0', '罗技(Logitech)K380多设备蓝牙键盘 芍药白'), ('1000022437810901', '9成新', '0', '罗技(Logitech)K380多设备蓝牙键盘 茱萸粉'), ('1000032033200901', '9成新', '0', '罗技(Logitech)Pebble 茱萸粉 K380蓝牙键盘'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'))
#(('1000033031280901', '9成新', '0', '罗技(Logitech)K380多设备蓝牙键盘 芍药白'), ('1000022437810901', '9成新', '0', '罗技(Logitech)K380多设备蓝牙键盘 茱萸粉'), ('1000032033200701', '7成新', '0', '罗技(Logitech)Pebble 茱萸粉 K380蓝牙键盘 送女友 礼物 可爱 颜值 时尚'), ('1000032033200901', '9成新', '0', '罗技(Logitech)Pebble 茱萸粉 K380蓝牙键盘'), ('19143330701', '7成新', '0', '罗技（Logitech）K380多设备蓝牙键盘 IPAD键盘 手机键盘 红色'), ('19143360901', '9成新', '0', '罗技（Logitech）K380多设备蓝牙键盘 平板电脑键盘 蓝色'), ('19143330901', '9成新', '0', '罗技（Logitech）K380多设备蓝牙键盘 平板电脑键盘 红色'), ('19143360701', '7成新', '0', '罗技（Logitech）K380多设备蓝牙键盘 平板IPAD键盘 时尚便携 超薄巧克力按键 蓝牙鼠标伴侣 蓝色'), ('1000033031280701', '7成新', '0', '罗技(Logitech)K380多设备蓝牙键盘 芍药白'), ('1000022437810701', '7成新', '0', '罗技(Logitech)K380多设备蓝牙键盘 茱萸粉'), ('19143320701', '7成新', '0', '罗技（Logitech）K380多设备蓝牙键盘 平板IPAD键盘 时尚便携 超薄巧克力按键 蓝牙鼠标伴侣 深灰色'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'))
#(('1000022437810901', '9成新', '0', '罗技(Logitech)K380多设备蓝牙键盘 茱萸粉'), ('1000032033200901', '9成新', '0', '罗技(Logitech)Pebble 茱萸粉 K380蓝牙键盘'), ('1000033031280901', '9成新', '0', '罗技(Logitech)K380多设备蓝牙键盘 芍药白'), ('19143330701', '7成新', '0', '罗技（Logitech）K380多设备蓝牙键盘 IPAD键盘 手机键盘 红色'), ('58546226786', '99成新', '10242580', '科勒旗下品牌诺维达 智能马桶盖 即热式进口洁身器坐便盖板BD-K380T长款 即热式全功能'))
